# ScheduleHeightsOnSheet Methods (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
ScheduleHeightsOnSheet Methods
ScheduleHeightsOnSheet Class See Also
---
The ScheduleHeightsOnSheet type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Dispose |
| Equals | Determines whether the specified Object is equal to the current Object. (Inherited from Object.) |
| GetBodyRowHeights | Returns each row's height of schedule body on sheet view. |
| GetHashCode | Serves as a hash function for a particular type.  (Inherited from Object.) |
| GetType | Gets the Type of the current instance. (Inherited from Object.) |
| ToString | Returns a string that represents the current object. (Inherited from Object.) |

# See Also
ScheduleHeightsOnSheet Class
Autodesk.Revit.DB Namespace